Repository: wangchong2023/ZhiYu
Catalog: Sources/Localization/Catalogs/Common.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# demo.secureEnv.content
source: Secure Enclave-based key storage ensures cryptographic operations happen in hardware-isolated environment.
zh_hans: 硬件级 Keychain 加密与沙箱执行确保您的知识库始终保持私密安全。
zh_hant: 硬體级 Keychain 加密与沙箱執行確保您的知識庫始終保持私密安全。

# tags.agent
source: Agent
zh_hans: 智能体
zh_hant: 智能體

# demo.embedding.title
source: Vector Embeddings
zh_hans: 向量嵌入
zh_hant: 向量嵌入

# demo.consistency.content
source: Multi-version consistency checking detects conflicts and ensures knowledge integrity across synchronized devices.
zh_hans: 事务性保证确保知识图谱与向量索引在所有写入操作中保持同步。
zh_hant: 事務性保證確保知識圖譜与向量索引在所有寫入操作中保持同步。

# demo.toolInterface.content
source: Plugin system provides extensible tool interfaces allowing third-party integrations to extend platform capabilities.
zh_hans: 可扩展插件系统，允许 AI 模型通过安全接口与外部工具和服务交互。
zh_hant: 可擴展插件係統，允許 AI 模型通過安全接口与外部工具和服務交互。

# tags.storage
source: Storage
zh_hans: 本地存储
zh_hant: 本地存储

# demo.transformer.title
source: Transformer
zh_hans: Transformer 引擎
zh_hant: Transformer 引擎

# demo.memoryMgmt.content
source: Intelligent memory management monitors device resources and dynamically adjusts model loading to prevent OOM crashes.
zh_hans: 智能内存压力监控，自适应模型卸载，防止系统资源耗尽。
zh_hant: 智能記憶體壓力監控，自適應模型卸載，防止係統資源耗盡。

# demo.memoryMgmt.title
source: Memory Management
zh_hans: 内存管理
zh_hant: 記憶體管理

# tags.theory
source: Theory
zh_hans: 理论基础
zh_hant: 理論基础

# demo.vectorDB.content
source: Vector database stores and indexes embeddings for fast approximate nearest neighbor search at scale.
zh_hans: 高性能向量存储，支持近似最近邻搜索，实现亚毫秒级语义检索。
zh_hant: 高性能向量存储，支援近似最近邻搜尋，實現亞毫秒级語义检索。

# demo.hybridSearch.title
source: Hybrid Search
zh_hans: 混合搜索
zh_hant: 混合搜尋

# tags.performance
source: Performance
zh_hans: 性能优化
zh_hant: 性能最佳化

# demo.gateway.title
source: API Gateway
zh_hans: AI 网关
zh_hant: AI 網關

# tags.architecture
source: Architecture
zh_hans: 系统架构
zh_hant: 係統架構

# demo.integratesWith
source: Integrates with
zh_hans: 关联
zh_hant: 關联

# demo.toolchain.title
source: Processing Toolchain
zh_hans: AI 工具链
zh_hant: AI 工具链

# demo.chunking.content
source: Semantic chunking splits documents by meaning boundaries using embedding similarity detection, ensuring each chunk represents a coherent unit of knowledge.
zh_hans: 基于 NLP 边界检测将文档拆分为语义连贯的分块，以获得最佳检索粒度。
zh_hant: 基於 NLP 边界检测將文档拆分為語义連贯的分塊，以獲得最佳检索粒度。

# tags.rag
source: RAG
zh_hans: 检索增强生成
zh_hant: 检索增強生成

# demo.foundation
source: Foundation
zh_hans: 底层基座
zh_hant: 底层基座

# tags.llm
source: LLM
zh_hans: 大语言模型
zh_hant: 大語言模型

# tags.visual
source: Visual
zh_hans: 数据可视化
zh_hant: 資料可視化

source: Knowledge Count
zh_hans: 知识库节点数
zh_hant: 知識庫節点數

source: Error Occurred
zh_hans: 发生错误
zh_hant: 發生錯誤

# enterContentPlaceholder
source: Enter Content
zh_hans: 输入内容...
zh_hant: 輸入內容...

source: Theme Polar
zh_hans: 北极白
zh_hant: 北極白

source: Theme Sunset
zh_hans: 落日金
zh_hant: 落日金

source: Theme Neon
zh_hans: 霓虹夜
zh_hant: 霓虹夜

# search.filterTags
source: Search tags
zh_hans: 搜索标签
zh_hant: 搜尋標籤

# demo.pkm.1.title
source: Personal Knowledge Graph Guide
zh_hans: 个人知识图谱指南
zh_hant: 個人知識圖譜指南

# demo.pkm.1.content
source: A personal knowledge graph is not just a collection of notes, but the core of building a personal web-like second brain. This is typically constructed by categorizing notes into [[Theme]] and [[Entry]], and building [[Connection]] between them. For details on physical Markdown import, please refer to the associated file `personal_knowledge_graph_guide.md`.
zh_hans: 个人知识图谱不仅是简单的笔记收集，更是建立个人网状外脑的核心。这通常通过将笔记分类为[[主题]]与[[词条]]，并在它们之间建立[[关联]]来构建。物理导入的 Markdown 详情参见关联物理文件 `个人知识图谱指南.md`。
zh_hant: 個人知識圖譜不仅是简單的筆記收集，更是建立個人網狀外脑的核心。這通常通過將筆記分類為[[主題]]与[[词條]]，並在它們之間建立[[關联]]來構建。物理匯入的 Markdown 詳情参見關联物理檔案 `個人知識圖譜指南.md`。

# demo.pkm.2.title
source: Entry: What is a Neuron
zh_hans: 词条：什么是神经元
zh_hant: 词條：什麼是神經元

# demo.pkm.2.content
source: An entry is a core note type in a knowledge graph, focusing on specific definitions, concepts, names, events, and factual attributes. Take the "Neuron" entry as an example, it is typically connected to a [[Theme]] related to "Brain Science".
zh_hans: 词条是知识图谱中一种核心的笔记类型，专注于具体的定义、概念、人名、事件及事实属性。以“神经元”词条为例，它通常会与“脑科学”相关的[[主题]]进行关联。
zh_hant: 词條是知識圖譜中一種核心的筆記類型，專注於具體的定义、概念、人名、事件及事實屬性。以“神經元”词條為例，它通常會与“脑科學”相關的[[主題]]進行關联。

# demo.pkm.3.title
source: Cross-Domain Hub Guide
zh_hans: 跨领域笔记枢纽指南
zh_hant: 跨領域筆記樞纽指南

# demo.pkm.3.content
source: A cross-domain hub is a bridge page connecting different [[Knowledge Domain]]s. If it is removed, two originally disconnected knowledge domains will fall apart. It is a key hub for bridging interdisciplinary insights.
zh_hans: 跨领域笔记枢纽是连接不同[[知识领域]]的桥梁页面。如果它没了，两个本来不相连的知识领域就会断开，是联通跨界认知的重要枢纽。
zh_hant: 跨領域筆記樞纽是連線不同[[知識領域]]的橋梁頁面。如果它沒了，兩個本來不相連的知識領域就會斷開，是联通跨界認知的重要樞纽。

# demo.pkm.4.title
source: Voice Memo: Unlinked Note
zh_hans: 语音速记的未关联笔记
zh_hant: 語音速記的未關联筆記

# demo.pkm.4.content
source: An unlinked note is a page that has no connection lines at all, usually an inspiration draft you wrote down on the fly. Connecting it can help it integrate into your knowledge web.
zh_hans: 未关联笔记是完全没有建立任何链接线的页面，通常是你随手记下的灵感草稿。帮它建立关联能让它融入你的知识网络。
zh_hant: 未關联筆記是完全沒有建立任何链接線的頁面，通常是你隨手記下的靈感草稿。帮它建立關联能讓它融入你的知識網路。

# demo.pkm.5.title
source: Progressive Summarization Comparison
zh_hans: 渐进式总结对比分析
zh_hant: 渐進式總結對比分析

# demo.pkm.5.content
source: Compare and analyze traditional note-taking with ZhiYu's web-like knowledge graph. Introduce how to use progressive summarization highlighting to make notes easy to retrieve and connect.
zh_hans: 对比分析传统的记笔记与智宇的网状知识图谱。介绍如何利用渐进总结高亮，使笔记易于检索 and 关联。
zh_hant: 對比分析傳統的記筆記与智宇的網狀知識圖譜。介紹如何利用渐進總結高亮，使筆記易於检索 and 關联。

# demo.coffee.1.title
source: Luckin vs Starbucks Comparison Report
zh_hans: 瑞幸与星巴克商业对比报告
zh_hant: 瑞幸与星巴克商業對比报告

# demo.coffee.1.content
source: Compare and analyze the business models and cost structures of two coffee giants in the domestic market. Provide decision support for our new cafe planning through detailed data assessment. The physical imported file is `luckin_market_report.pdf`.
zh_hans: 对比分析两家咖啡巨头在国内市场的运营模式与成本结构。通过细致的数据评估，为我们新设立的咖啡馆规划提供决策支持。物理导入文件为 `瑞幸与星巴克商业对比报告.pdf`。
zh_hant: 對比分析兩家咖啡巨頭在國內市場的運營模式与成本結構。通過細致的資料評估，為我們新設立的咖啡館規劃提供決策支援。物理匯入檔案為 `瑞幸与星巴克商業對比报告.pdf`。

# demo.coffee.2.title
source: Entry: What is Coffee Roasting Level
zh_hans: 词条：什么是咖啡豆烘焙度
zh_hant: 词條：什麼是咖啡豆烘焙度

# demo.coffee.2.content
source: An entry focuses on specific coffee definitions. For example, the roasting level determines the flavor tone of coffee beans, divided into light, medium, and dark roasts, each with different physical and chemical changes. This entry is imported via smart OCR physical scanning.
zh_hans: 词条专注于具体的咖啡定义。例如，烘焙度决定了咖啡豆的风味基调，分为浅焙、中焙和深焙，各具不同的物理 and 化学变化。本词条通过智能 OCR 物理扫描导入。
zh_hant: 词條專注於具體的咖啡定义。例如，烘焙度決定了咖啡豆的風味基調，分為淺焙、中焙和深焙，各具不同的物理 and 化學變化。本词條通過智能 OCR 物理掃描匯入。

# demo.coffee.3.title
source: Coffee Chain Site Selection Planning
zh_hans: 咖啡连锁行业选址规划
zh_hant: 咖啡連鎖行業選址規劃

# demo.coffee.3.content
source: The theme focuses on the methodology and evaluation logic of site selection planning. Introduce core planning steps such as business district traffic, rent models, and customer profiling.
zh_hans: 主题侧重于选址规划的方法论与评估逻辑。介绍商圈流量、租金模型及人群画像等核心规划步骤。
zh_hant: 主題侧重於選址規劃的方法論与評估逻辑。介紹商圈流量、租金模型及人群畫像等核心規劃步骤。

# demo.coffee.4.title
source: Voice Memo: Equipment Procurement List
zh_hans: 语音速记：咖啡设备采购清单
zh_hant: 語音速記：咖啡設備采購清單

# demo.coffee.4.content
source: Quickly record the procurement list and budget through voice narration, such as commercial espresso machines, grinders, and water purification equipment procurement planning. The physical file is a `.mp3` recording converted from voice.
zh_hans: 通过语音口述快速记录的采购清单和预算，例如商用意式机、磨豆机和净水设备采购规划。物理文件为语音转换的 `.mp3` 录音文件。
zh_hant: 通過語音口述快速記錄的采購清單和預算，例如商用意式機、磨豆機和淨水設備采購規劃。物理檔案為語音轉換的 `.mp3` 錄音檔案。

# demo.coffee.5.title
source: Coffee Shop Daily Operations Manual
zh_hans: 咖啡店日常运营手册
zh_hant: 咖啡店日常運營手册

# demo.coffee.5.content
source: Explain in detail the daily opening workflow, hygiene standards, and service scripts of coffee shops. This is an important guidance for standardized operation of coffee shops.
zh_hans: 详细讲解咖啡门店的日常开店流程、卫生标准以及服务话术。这是咖啡店标准化运营的重要指导。
zh_hant: 詳細讲解咖啡門店的日常開店流程、衛生標準以及服務話術。這是咖啡店標準化運營的重要指导。

# tags.knowledgeMgmt
source: Knowledge Mgmt
zh_hans: 知识管理
zh_hant: 知識管理

# tags.methodology
source: Methodology
zh_hans: 方法论
zh_hant: 方法論

# tags.noteStyles
source: Note Styles
zh_hans: 笔记流派
zh_hant: 筆記流派

# tags.efficiency
source: Efficiency
zh_hans: 效率
zh_hant: 效率

# tags.techPrinciple
source: Principle
zh_hans: 技术原理
zh_hant: 技術原理

# tags.association
source: Association
zh_hans: 关联
zh_hant: 關联

# tags.cognitivePsych
source: Psychology
zh_hans: 认知心理
zh_hant: 認知心理

# tags.retrievalTech
source: Retrieval
zh_hans: 检索技术
zh_hant: 检索技術

# tags.brainSci
source: Brain Science
zh_hans: 脑科学
zh_hant: 脑科學

# tags.learningMethod
source: Learning
zh_hans: 学习方法
zh_hant: 學習方法

# tags.fileMgmt
source: File Mgmt
zh_hans: 文件管理
zh_hant: 檔案管理

# tags.productivity
source: Productivity
zh_hans: 生产力
zh_hant: 生產力

# tags.workflow
source: Workflow
zh_hans: 工作流
zh_hant: 工作流

# tags.architectureOrg
source: Organization
zh_hans: 组织架构
zh_hant: 組織架構

# tags.readingMethod
source: Reading
zh_hans: 阅读法
zh_hant: 閱讀法

# tags.summary
source: Summary
zh_hans: 总结
zh_hant: 總結

# tags.creation
source: Creation
zh_hans: 创作
zh_hant: 創作

# tags.output
source: Output
zh_hans: 输出
zh_hant: 輸出

# tags.biography
source: Biography
zh_hans: 人物传记
zh_hant: 人物傳記

# tags.metaphor
source: Metaphor
zh_hans: 隐喻
zh_hant: 隱喻

# tags.innovation
source: Innovation
zh_hans: 创新
zh_hant: 創新

# tags.competitorAnalysis
source: Competitor
zh_hans: 竞品分析
zh_hant: 競品分析

# tags.marketResearch
source: Market Research
zh_hans: 市场调研
zh_hant: 市場調研

# tags.productDesign
source: Product Design
zh_hans: 产品设计
zh_hant: 產品設计

# tags.operation
source: Operation
zh_hans: 运营
zh_hant: 運營

# tags.userResearch
source: User Research
zh_hans: 用户调研
zh_hant: 使用者調研

# tags.infrastructure
source: Infrastructure
zh_hans: 基础设施
zh_hant: 基础設施

# tags.decoration
source: Decoration
zh_hans: 装修
zh_hant: 装修

# tags.finance
source: Finance
zh_hans: 财务
zh_hant: 财務

# tags.team
source: Team
zh_hans: 团队
zh_hant: 團隊

# tags.recruitment
source: Recruitment
zh_hans: 招聘
zh_hant: 招聘

# tags.supplyChain
source: Supply Chain
zh_hans: 供应链
zh_hant: 供應链

# tags.materials
source: Materials
zh_hans: 物料
zh_hant: 物料

# tags.design
source: Design
zh_hans: 设计
zh_hant: 設计

# tags.marketing
source: Marketing
zh_hans: 营销
zh_hant: 營銷

# tags.rd
source: R&D
zh_hans: 研发
zh_hant: 研發

# demo.fallback.methodology
source: # Personal Knowledge Graph Construction and Growth Guide ## 1. Why Do We Need a Personal Knowledge Graph? In today's information explosion era, we receive a massive amount of news, articles, audio-visual content, and inspiration fragments every day. Traditional note-taking methods, whether linear outlines or hierarchical classification according to tree-like folders, face a difficult pain point: as the number of notes increases, the information becomes isolated, forming "information islands." This not only makes it difficult for us to retrieve information quickly when needed, but also limits our ability to discover potential connections between different knowledge points. Karpathy's knowledge management methodology advocates viewing knowledge from the perspective of a network topology. This idea has been perfectly inherited and developed in the ZhiYu application. A personal knowledge graph is like our own customized "digital second brain." Instead of simply piling notes together, it simulates the neuron network of the human brain, taking individual knowledge points as nodes and connecting them into a network that can continuously grow and dynamically evolve through logical association. In this network, there is no fixed starting point or ending point, and every concept and fact can become an entry point for exploration. ## 2. Core Constructing Elements of a Knowledge Graph In ZhiYu's web-like knowledge network, we mainly use the following basic elements to organize information to avoid the confusion of traditional classification: * **🔵 Theme (Concept)**: This is the main pillar in the knowledge network. It focuses on principles, core concepts, general methodologies, abstract mental models, or cross-domain research topics. For example, "Memory Improvement Methods" or "Supply Chain Optimization Strategy" can be used as a "Theme" note. * **🟡 Entry (Entity)**: This is the fine-grained detail in the knowledge network. It focuses on specific noun explanations, character profiles, specific events, theorem formulas, or attribute definitions. For example, "Ebbinghaus Forgetting Curve" or "Water Purification Equipment Specification" are typical "Entry" notes. * **Connection**: This is the bridge connecting different themes and entries. In ZhiYu, we establish this connection through double-bracket syntax (such as bi-directional linking). When you mention a specific entry in a theme note, establishing a link not only makes it easy for you to jump in one click in the future, but also clearly shows their relationship on the 3D graph. Through this "Theme-Entry" classification and connection, we can both overlook the huge macro knowledge network and deeply inspect the details of specific definitions from a micro perspective. ## 3. Zero-Threshold Knowledge Accumulation Steps To build your own knowledge graph, you do not need complex professional training. You can easily start your knowledge journey by following these three steps: ### Step 1: Capture with No Pressure Whether it is an inspiration fragment that flashes on the bus, a scan of a roadside poster, a recording of a meeting speech, or a business analysis from a professional website, you can import them into ZhiYu at the first time. At this time, you do not need to consider perfect layout, and collecting raw materials is the first priority. ### Step 2: Progressive Summarization When you review these imported materials, you can refine them for a second time. Rewrite them in plain language, or use bolding and underlining to mark key sentences. This refinement not only deepens your memory, but also helps you convert complex raw documents into refined, easy-to-retrieve knowledge. ### Step 3: Establish Connections This is the most critical step. When refining content, always look for its connection to your existing notes. Can this Luckin comparison report be linked to your "Coffee Shop Site Selection Planning"? Can this forgetting curve definition be linked to your "Personal Learning Methodology"? Use double brackets to link them together. As links increase, your graph will spontaneously emerge with clear veins. ## 4. The Long-Term Value Brought by Your Knowledge Graph Building a personal knowledge graph is a long-term process with compounding effects. First, it greatly improves your retrieval efficiency, letting you completely get rid of the trouble of "which folder this note is stored in"; second, it stimulates your association and creativity. By viewing the 3D graph, you might suddenly find that there is some beautiful cross-connection between two seemingly unrelated fields. This web-like second brain can evolve together with your thinking, eventually becoming an inseparable part of your personal wisdom, helping you make more visionary decisions in study, work, and research.
zh_hans: # 个人知识图谱构建与成长指南 ## 1. 为什么我们需要个人知识图谱？ 在当今的信息爆炸时代，我们每天都会接收到海量的新闻、文章、视听内容和灵感碎片。传统的记笔记方式，无论是线性大纲，还是按照树状文件夹进行的层级分类，都面临着一个难以解决的痛点：随着笔记数量的增加，信息之间会变得孤立，形成“信息孤岛”。这不仅让我们难以在需要时快速检索，更限制了我们发现不同知识点之间潜在联系的能力。 卡帕西的知识管理方法论提倡以网状拓扑的视角来看待知识。这种思路在智宇应用中得到了完美的继承和发扬。个人知识图谱就像是我们自己定制的“数字外脑”，它不是把笔记简单地堆积在一起，而是模拟人类大脑的神经元网络，将一个个知识点作为节点，通过逻辑关联把它们连接成一张可以不断成长、动态演化的网。在这张网中，没有固定的起点和终点，每一个概念和事实都可以成为探索的入口。 ## 2. 知识图谱的核心构建元素 在智宇的网状知识网络中，我们主要利用以下几种基本元素来组织信息，以避免传统分类的混乱： * **🔵 主题 (Concept)**：这是知识网络中的主要支柱。它侧重于原理、核心概念、通用方法论、抽象的思维模型或者跨领域的研究课题。例如，“记忆力提升方法”、“供应链优化策略”都可以作为一个“主题”笔记。 * **🟡 词条 (Entity)**：这是知识网络中的细粒度细节。它侧重于具体的名词解释、人物简介、特定事件、定理公式或者属性定义。例如，“艾宾浩斯遗忘曲线”或者“净水设备规格说明”就是典型的“词条”笔记。 * **关联 (Connection)**：这是连接不同主题和词条的桥梁。在智宇中，我们通过双括号语法（如双向链接）来建立这种联系。当你在一个主题笔记里提到某个具体词条时，建立链接不仅能方便你未来一键跳转，更能在3D图谱上清晰地展现它们之间的关联。 通过这种“主题-词条”的分类与关联，我们既能俯瞰庞大的宏观知识网络，又能微观深入地查看具体定义的细节。 ## 3. 零门槛的知识积累步骤 想要构建自己的知识图谱，你并不需要复杂的专业培训。你可以按照以下三个步骤，轻松地开始你的知识之旅： ### 第一步：无压力捕获 (Capture) 无论是一段在公交车上闪现的灵感、一张路边海报的扫描图、一段会议发言的录音，还是一篇来自专业网站的商业分析，你都可以第一时间将它们导入智宇。此时不需要考虑完美的排版，将原材料收集起来是第一要务。 ### 第二步：渐进式总结 (Summarize) 当你重新回顾这些导入的素材时，可以对其进行二次提炼。使用大白话去重写它，或者使用加粗、划线来标识关键语句。这种提炼不仅能加深你的记忆，更能帮助你将繁杂的原始文档转化为精炼的、易于检索的知识。 ### 第三步：建立关联 (Link) 这是最关键的一步。在提炼内容时，时刻寻找它与你已有笔记的关联。这篇瑞幸的对比报告是否可以关联到你的“咖啡店选址规划”？这个遗忘曲线的定义是否可以关联到你的“个人学习方法论”？使用双括号将它们连结起来。随着链接的增加，你的图谱会自发地涌现出清晰的脉络。 ## 4. 知识图谱带给你的长期价值 构建个人知识图谱是一个长期而有复利效应的过程。首先，它能极大提高你的检索效率，让你彻底摆脱“这篇笔记存在哪个文件夹”的烦恼；其次，它能激发你的联想与创造力。通过查看3D图谱，你可能会突然发现两个看似不相关的领域之间其实有着某种美妙的交叉关联。这种网状的外脑能够随着你的思考一起进化，最终成为你个人智慧不可分割的一部分，帮助你在学习、工作和研究中做出更具远见的决策。
zh_hant: # 個人知識圖譜構建与成長指南 ## 1. 為什麼我們需要個人知識圖譜？ 在当今的資訊爆炸時代，我們每天都會接收到海量的新聞、文章、視聽內容和靈感碎片。傳統的記筆記方式，無論是線性大纲，还是按照树狀檔案夾進行的层级分類，都面臨著一個难以解決的痛点：隨著筆記數量的增加，資訊之間會變得孤立，形成“資訊孤岛”。這不仅讓我們难以在需要時快速检索，更限制了我們發現不同知識点之間潛在联係的能力。 卡帕西的知識管理方法論提倡以網狀拓撲的視角來看待知識。這種思路在智宇套用中得到了完美的继承和發揚。個人知識圖譜就像是我們自己定制的“數字外脑”，它不是把筆記简單地堆積在一起，而是模擬人類大脑的神經元網路，將一個個知識点作為節点，通過逻辑關联把它們連線成一張可以不斷成長、動態演化的網。在這張網中，沒有固定的起点和終点，每一個概念和事實都可以成為探索的入口。 ## 2. 知識圖譜的核心構建元素 在智宇的網狀知識網路中，我們主要利用以下幾種基本元素來組織資訊，以避免傳統分類的混亂： * **🔵 主題 (Concept)**：這是知識網路中的主要支柱。它侧重於原理、核心概念、通用方法論、抽象的思維模型或者跨領域的研究課題。例如，“記憶力提升方法”、“供應链最佳化策略”都可以作為一個“主題”筆記。 * **🟡 词條 (Entity)**：這是知識網路中的細粒度細節。它侧重於具體的名词解釋、人物简介、特定事件、定理公式或者屬性定义。例如，“艾宾浩斯遺忘曲線”或者“淨水設備規格說明”就是典型的“词條”筆記。 * **關联 (Connection)**：這是連線不同主題和词條的橋梁。在智宇中，我們通過雙括號語法（如雙向链接）來建立這種联係。当你在一個主題筆記裏提到某個具體词條時，建立链接不仅能方便你未來一鍵跳轉，更能在3D圖譜上清晰地展現它們之間的關联。 通過這種“主題-词條”的分類与關联，我們既能俯瞰龐大的宏觀知識網路，又能微觀深入地查看具體定义的細節。 ## 3. 零門槛的知識積累步骤 想要構建自己的知識圖譜，你並不需要複雜的專業培训。你可以按照以下三個步骤，輕松地開始你的知識之旅： ### 第一步：無壓力捕獲 (Capture) 無論是一段在公交車上閃現的靈感、一張路边海报的掃描圖、一段會議發言的錄音，还是一篇來自專業網站的商業分析，你都可以第一時間將它們匯入智宇。此時不需要考慮完美的排版，將原材料收集起來是第一要務。 ### 第二步：渐進式總結 (Summarize) 当你重新回顾這些匯入的素材時，可以對其進行二次提炼。使用大白話去重寫它，或者使用加粗、劃線來標識關鍵語句。這種提炼不仅能加深你的記憶，更能說明你將繁雜的原始文档轉化為精炼的、易於检索的知識。 ### 第三步：建立關联 (Link) 這是最關鍵的一步。在提炼內容時，時刻尋找它与你已有筆記的關联。這篇瑞幸的對比报告是否可以關联到你的“咖啡店選址規劃”？這個遺忘曲線的定义是否可以關联到你的“個人學習方法論”？使用雙括號將它們連結起來。隨著链接的增加，你的圖譜會自發地涌現出清晰的脈絡。 ## 4. 知識圖譜带給你的長期價值 構建個人知識圖譜是一個長期而有複利效應的過程。首先，它能極大提高你的检索效率，讓你彻底摆脫“這篇筆記存在哪個檔案夾”的烦恼；其次，它能激發你的联想与創造力。通過查看3D圖譜，你可能會突然發現兩個看似不相關的領域之間其實有著某種美妙的交叉關联。這種網狀的外脑能够隨著你的思考一起進化，最終成為你個人智慧不可分割的一部分，說明你在學習、工作和研究中做出更具遠見的決策。

# demo.fallback.workflow
source: Knowledge management workflows: capture, chunk, retrieve, synthesize. Integrate daily tools into a unified knowledge loop.
zh_hans: 知识管理工作流：捕获、分块、检索、合成。将日常工具集成到统一的知识闭环中。
zh_hant: 知識管理工作流：捕獲、分塊、检索、合成。將日常工具集成到統一的知識闭環中。
